var Mock = require('mockjs');
Mock.setup({timeout:'1200-2600'});
Mock.mock('/data',{
    // 属性 list 的值是一个数组，其中含有 1 到 10 个元素
    'list|1-10': [{
        "key|+1":1,
        // 属性 id 是一个自增数，起始值为 1，每次增 1
        'id|+1': 1,
        "name|1":['tom','林俊杰','刘诗诗',"郑凯",'尼古拉灯赵四'],
        "age|18-28":0,
        "sex|1":['男',"女"],
        "birtary|1":["2021-02-12",'2012-02-36','1997-02-23'],
        'money|1':[18000,20000,19500],
        "address|1":["河北省","北京市","天津市"],
        "car|1":["劳斯劳斯",'奔驰',"本田"]
    }]
})